app/views/camps/_active_camps.html.erb

SELECT COUNT(*) FROM "registrations" WHERE "registrations"."camp_id" = ?  [["camp_id", 4]]
---
          Max Students: <%= camp.max_students %>
          Open Slots: <%= camp.max_students - camp.registrations.count %>