app/views/camps/_add_registration_vue.html.erb

SELECT "students".* FROM "students" INNER JOIN "registrations" ON "students"."id" = "registrations"."student_id" WHERE "registrations"."camp_id" = ?  [["camp_id", 21]]
SELECT  1 AS one FROM "students" INNER JOIN "registrations" ON "students"."id" = "registrations"."student_id" WHERE "registrations"."camp_id" = ? LIMIT ?
---

    <% if @camp.students.empty? %>

SELECT COUNT(*) FROM "students" INNER JOIN "registrations" ON "students"."id" = "registrations"."student_id" WHERE "registrations"."camp_id" = ?
---
    <% else %>
      <span class="card-title">Students(<%= @camp.students.size %>)</span>

SELECT "students".* FROM "students" INNER JOIN "registrations" ON "students"."id" = "registrations"."student_id" WHERE "registrations"."camp_id" = ?
---
      <tbody>
        <% @camp.students.each do |s| %>