app/views/camps/_camp_details.html.erb

SELECT COUNT(*) FROM "registrations" WHERE "registrations"."camp_id" = ?
---
    <p><strong>Camp: </strong>$<%= @camp.cost %>0</p>
    <p><strong>Slots Remaining: </strong><%= @camp.max_students - @camp.registrations.count %></p>