app/views/camps/_camp_instructor_form_template.html.erb


            collection: Instructor.active.alphabetical.select {|i| !@camp.instructors.include? i}.to_a,

---
SELECT "instructors".* FROM "instructors" WHERE "instructors"."active" = ? ORDER BY last_name, first_name