app/views/camps/show.html.erb

  <div class="col s5">
    <% if logged_in? && (current_user.role?(:admin) || @camp.instructors.map{|i| i.user.id}.include?(current_user.id))%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?
SELECT "instructors".* FROM "instructors" INNER JOIN "camp_instructors" ON "instructors"."id" = "camp_instructors"."instructor_id" WHERE "camp_instructors"."camp_id" = ?