app/views/home/_personal_home.html.erb

SELECT  "instructors".* FROM "instructors" WHERE "instructors"."user_id" = ? LIMIT ?
---
<h1>Hello, <%if current_user.role? :parent %> <%= current_user.family.parent_first_name.capitalize %> <% else %> <%= current_user.instructor.first_name %> <% end %></h1>