app/controllers/camps_controller.rb

SELECT "instructors".* FROM "instructors" INNER JOIN "camp_instructors" ON "instructors"."id" = "camp_instructors"."instructor_id" WHERE "camp_instructors"."camp_id" = ? ORDER BY last_name, first_name  [["camp_id", 21]]
SELECT "students".* FROM "students" INNER JOIN "registrations" ON "students"."id" = "registrations"."student_id" WHERE "registrations"."camp_id" = ? ORDER BY last_name, first_name
---
  def show
    @instructors = @camp.instructors.alphabetical
    @registrations = @camp.students.alphabetical.to_a

SELECT  "camps".* FROM "camps" WHERE "camps"."id" = ? LIMIT ?
---
    def set_camp
      @camp = Camp.find(params[:id])