app/controllers/families_controller.rb

    def set_family
      @family = Family.find(params[:id])
---
SELECT  "families".* FROM "families" WHERE "families"."id" = ? LIMIT ?