app/controllers/home_controller.rb

SELECT "camps".* FROM "camps" WHERE (start_date >= '2018-05-09')
SELECT "camps".* FROM "camps" WHERE "camps"."curriculum_id" = ?  [["curriculum_id", 1]]
SELECT "curriculums".* FROM "curriculums"
SELECT "camps".* FROM "camps" WHERE "camps"."curriculum_id" = ?
SELECT COUNT(*) FROM "registrations"
SELECT COUNT(*) FROM "students" WHERE "students"."active" = ?
SELECT COUNT(*) FROM "families" WHERE "families"."active" = ?
SELECT COUNT(*) FROM "instructors" WHERE "instructors"."active" = ?
SELECT "camps".* FROM "camps" WHERE "camps"."active" = ?
SELECT COUNT(*) FROM "students" INNER JOIN "registrations" ON "students"."id" = "registrations"."student_id" WHERE "registrations"."camp_id" = ?
---
  def index

  	@reg = Camp.upcoming.map{|c| c.enrollment}.to_a.first(5)
  	@curric = Curriculum.all.map{|c| c.name}.to_a
  	@all_curric = Curriculum.all

  	@reg_count = []
  	@all_curric.each{ |curric|
  		count = 0
  		c_camps = curric.camps.to_a
  		c_camps.each{|cc|
  			count += cc.enrollment}
  		@reg_count.push(count)
  	}


  	# @reg_count = Curriculum.all.map{|c| c.camps.upcoming.map{|cmp| cmp.enrollment}}.flatten.to_a
  	@camps = Camp.upcoming.map{|c| c.name}.to_a.first(5)



    @regcount = Registration.all.count
    @stucount = Student.active.count
    @famcount = Family.active.count
    @instrucount = Instructor.active.count

    @camp_sort = Camp.active.sort_by {|f| f.students.count}.reverse.first(10)

SELECT "camps".* FROM "camps"
---


    #parent
    @random = Camp.all.sample(3).to_a