app/models/ability.rb

SELECT  "instructors".* FROM "instructors" WHERE "instructors"."user_id" = ? LIMIT ?
SELECT "students".* FROM "students" INNER JOIN "registrations" ON "students"."id" = "registrations"."student_id" INNER JOIN "camps" ON "registrations"."camp_id" = "camps"."id" INNER JOIN "camp_instructors" ON "camps"."id" = "camp_instructors"."camp_id" WHERE "camp_instructors"."instructor_id" = ?
---
        end

        can :read, Student do |this_student|
          my_students = user.instructor.students.map(&:id)
          my_students.include? this_student.id
        end
        can :read, Family do |this_family|
          my_students = user.instructor.students.map(&:family_id)