app/models/camp.rb

  def enrollment
    self.registrations.count
---
SELECT COUNT(*) FROM "registrations" WHERE "registrations"."camp_id" = ?